src/DataProcessors/СогласованиеЗаявок/СогласованиеЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СогласованиеЗаявок</name>
  <attributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйОтчет</name>
    <type>
      <types>CatalogRef.ПроизвольныеОтчеты</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненнаяНастройка</name>
    <type>
      <types>CatalogRef.СохраненныеНастройки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаявкиНаРасходованиеСредств</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийЗаявкиНаРасходование</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРасхода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.КассыККМ</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.МаршрутыСогласования</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаОплаты</name>
      <type>
        <types>EnumRef.ВидыДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БанковскийСчетКасса</name>
      <comment>Банковский счет, касса</comment>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
        <types>CatalogRef.Кассы</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущееСостояние</name>
      <type>
        <types>EnumRef.СостоянияОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоследнийСогласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/СостоянияСогласованияЗаявок/СостоянияСогласованияЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияСогласованияЗаявок</name>
  <comment>Состояния согласования заявок на расходование денежных средств</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.МаршрутыСогласования</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ЗаявкиНаРасходованиеСредств/ЗаявкиНаРасходованиеСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаявкиНаРасходованиеСредств</name>
  <comment>(Упр)</comment>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте упр. учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>Сумма к оплате</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаНаРасходование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ПлатежноеТребованиеПоручениеПолученное</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.ПлатежноеТребованиеПоручениеВыставленное</types>
      <types>DocumentRef.АккредитивПолученный</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПлатежноеТребованиеПолученное</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АккредитивПереданный</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.КорректировкаДолгаПоВозвратнойТаре</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПлатежноеТребованиеВыставленное</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРасчетовСКонтрагентом</name>
    <type>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ПлатежноеТребованиеПоручениеПолученное</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.ПлатежноеТребованиеПоручениеВыставленное</types>
      <types>DocumentRef.АккредитивПолученный</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПлатежноеТребованиеПолученное</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АккредитивПереданный</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КорректировкаДолгаПоВозвратнойТаре</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПлатежноеТребованиеВыставленное</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыОперацийЗаявкиНаРасходование/ВидыОперацийЗаявкиНаРасходование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЗаявкиНаРасходование</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствКассеККМ</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитамИЗаймамСКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитамИЗаймамСРаботниками</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалога</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПеречислениеЗП</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчетыСКонтрагентами</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СостоянияОбъектов/СостоянияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОбъектов</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/МаршрутыСогласования/МаршрутыСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МаршрутыСогласования</name>
  <comment>Маршруты согласования заявок на расходование денежных средств</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <tabularSections>
    <name>СогласующиеЛица</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/СогласованиеЗаявок/Forms/ФормаУправляемая/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЗАЯВКИ

&НаКлиенте
Функция ПолучитьТекущуюСтрокуСписка()
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено 
		ИЛИ ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТекущаяСтрока;
	
КонецФункции // 

&НаКлиенте
Функция ПолучитьИмяФормыПоВидуОперации(ВидОперации)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ИмяФормыПоВидуОперации = "ФормаОбъекта";
	#Иначе
	Если ВидОперации = ВидОперацииОплатаПоставщику 
		ИЛИ ВидОперации = ВидОперацииВозвратДенежныхСредствПокупателю
		ИЛИ ВидОперации = ВидОперацииПрочиеРасчетыСКонтрагентами Тогда
		
		ИмяФормыПоВидуОперации = "Форма.РасчетыСКонтрагентами";
		
	ИначеЕсли ВидОперации = ВидОперацииВыдачаДенежныхСредствПодотчетнику Тогда
		ИмяФормыПоВидуОперации = "Форма.РасчетыСПодотчетнымиЛицами";
		
	ИначеЕсли ВидОперации = ВидОперацииПрочийРасходДенежныхСредств Тогда
		ИмяФормыПоВидуОперации = "Форма.ПрочийРасходДенежныхСредств";
		
	Иначе
		ИмяФормыПоВидуОперации = "ФормаОбъекта";
	КонецЕсли; 
	#КонецЕсли
	
	Возврат "Документ.ЗаявкаНаРасходованиеСредств." + ИмяФормыПоВидуОперации;
	
КонецФункции // 

&НаКлиенте
Процедура ОткрытьФормуВыбранногоДокумента()

	ТекущаяСтрока = ПолучитьТекущуюСтрокуСписка();
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПолноеИмяФормы = ПолучитьИмяФормыПоВидуОперации(ТекущиеДанные.ВидОперации);
	
	ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Ссылка);
	ОткрытьФорму(ПолноеИмяФормы, ПараметрыФормы);
	
КонецПроцедуры //

&НаКлиенте
Процедура ИзменитьСтатусЗаявок(НовоеСостояние)

	Объект.ЗаявкиНаРасходованиеСредств.Очистить();
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Для Каждого ИндексСтроки ИЗ ВыделенныеСтроки Цикл
		Если ТипЗнч(ИндексСтроки) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ИндексСтроки);
		
		СтрокаТабличнойЧасти = Объект.ЗаявкиНаРасходованиеСредств.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ДанныеСтроки);
		
		СтрокаТабличнойЧасти.Пометка          = Истина;
		СтрокаТабличнойЧасти.Заявка           = ДанныеСтроки.Ссылка;
		СтрокаТабличнойЧасти.ТекущееСостояние = ДанныеСтроки.Состояние;
	КонецЦикла;
	
	Если Объект.ЗаявкиНаРасходованиеСредств.Количество() = 0 Тогда
		Предупреждение(НСтр("ru = 'Не выбрано ни одной заявки'"));
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Объект);
	ПараметрыФормы.Вставить("НовоеСостояние", НовоеСостояние);
	ПараметрыФормы.Вставить("Заявки", Объект.ЗаявкиНаРасходованиеСредств);
	
	СвойстваОбъекта = Новый Структура;
	СвойстваОбъекта.Вставить("ТекущийПользователь",  Объект.ТекущийПользователь);
	СвойстваОбъекта.Вставить("ПроизвольныйОтчет",    Объект.ПроизвольныйОтчет);
	СвойстваОбъекта.Вставить("СохраненнаяНастройка", Объект.СохраненнаяНастройка);
	
	ПараметрыФормы.Вставить("СвойстваОбъекта",  СвойстваОбъекта);
	
	ОткрытьФорму("Обработка.СогласованиеЗаявок.Форма.ИзменениеСостоянияЗаявокУправляемая", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбранногоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОткрытьФормуВыбранногоДокумента();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ

&НаКлиенте
Процедура Отклонить(Команда)
	
	ИзменитьСтатусЗаявок(СостоянияОбъектовОтклонен);
	
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	
	ИзменитьСтатусЗаявок(СостоянияОбъектовОтложен);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	
	ИзменитьСтатусЗаявок(СостоянияОбъектовСогласован);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтчета(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПроизвольныйОтчет", Объект.ПроизвольныйОтчет);
	ПараметрыФормы.Вставить("СохраненнаяНастройка", Объект.СохраненнаяНастройка);
	
	РезультатНастройки = ОткрытьФормуМодально("Обработка.СогласованиеЗаявок.Форма.НастройкаОтчета", ПараметрыФормы);
	Если РезультатНастройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПроизвольныйОтчет = РезультатНастройки.ПроизвольныйОтчет;
	Объект.СохраненнаяНастройка   = РезультатНастройки.СохраненнаяНастройка;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ФОРМА

&НаСервере
Функция ПолучитьЭтапыСогласованияПользователя()
	
	СписокЭтапов = Новый Массив;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Ссылка КАК ЭтапСогласования
	               |ИЗ
	               |	Справочник.МаршрутыСогласования.СогласующиеЛица КАК МаршрутыСогласованияСогласующиеЛица
	               |ГДЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Пользователь = &ТекПользователь
	               |";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекПользователь", Объект.ТекущийПользователь);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокЭтапов.Добавить(Выборка.ЭтапСогласования);
	КонецЦикла;
	
	Возврат СписокЭтапов
	
КонецФункции // 

&НаСервере
Функция ПолучитьЭтапыМаршрутовВКоторыхУчаствуетПользователь(ЭтапыСогласования)
	
	СписокЭтапов = Новый Массив;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МаршрутыСогласования.Ссылка КАК ЭтапСогласования
	               |ИЗ
	               |	Справочник.МаршрутыСогласования КАК МаршрутыСогласования
	               |ГДЕ
	               |	МаршрутыСогласования.Ссылка В ИЕРАРХИИ (&ЭтапыСогласования)";
	 
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекПользователь", Объект.ТекущийПользователь);
	Запрос.УстановитьПараметр("ЭтапыСогласования", ЭтапыСогласования);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокЭтапов.Добавить(Выборка.ЭтапСогласования);
	КонецЦикла;
	
	Возврат СписокЭтапов
	
КонецФункции // 

&НаСервере
Процедура ВосстановитьНастройкиОтборов(ДанныеОтбора)
	
	Список.Отбор.Элементы.Очистить();
	
	Если ДанныеОтбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТиповыеОтчеты.СкопироватьЭлементы(Список.Отбор, ДанныеОтбора);

КонецПроцедуры

// В процедуре инициализируются значения констант формы
// Константы используются при выполнении модуля формы
//
&НаСервере
Процедура УстановитьЗначенияКонстантФормы()
	
	ВидОперацииОплатаПоставщику                  = Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
	ВидОперацииВозвратДенежныхСредствПокупателю  = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю;
	ВидОперацииПрочиеРасчетыСКонтрагентами       = Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами;
	ВидОперацииВыдачаДенежныхСредствПодотчетнику = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствПодотчетнику;
	ВидОперацииПрочийРасходДенежныхСредств       = Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочийРасходДенежныхСредств;
	
	СостоянияОбъектовСогласован = Перечисления.СостоянияОбъектов.Согласован;
	СостоянияОбъектовОтклонен   = Перечисления.СостоянияОбъектов.Отклонен;
	СостоянияОбъектовОтложен    = Перечисления.СостоянияОбъектов.Отложен;
	
	Объект.ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	
КонецПроцедуры //

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначенияКонстантФормы();
	
	ЭтапыСогласования = ПолучитьЭтапыСогласованияПользователя();
	СписокЭтапов = ПолучитьЭтапыМаршрутовВКоторыхУчаствуетПользователь(ЭтапыСогласования);
	
	Список.Параметры.УстановитьЗначениеПараметра("ЭтапыСогласованияПользователя", ЭтапыСогласования);
	Список.Параметры.УстановитьЗначениеПараметра("ЭтапыМаршрутовВКоторыхУчаствуетПользователь", СписокЭтапов);
		
	МассивВидыОперацийРасчетыСКонтрагентами = Новый Массив;
	МассивВидыОперацийРасчетыСКонтрагентами.Добавить(Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю);
	МассивВидыОперацийРасчетыСКонтрагентами.Добавить(Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику);
	МассивВидыОперацийРасчетыСКонтрагентами.Добавить(Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами);
	МассивВидыОперацийРасчетыСКонтрагентами.Добавить(Перечисления.ВидыОперацийЗаявкиНаРасходование.РасчетыПоКредитамИЗаймамСКонтрагентами);
	
	Список.Параметры.УстановитьЗначениеПараметра("ВидыОперацийРасчетыСКонтрагентами", МассивВидыОперацийРасчетыСКонтрагентами);
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекПользователь", Объект.ТекущийПользователь);
		
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеСогласован",  Перечисления.СостоянияОбъектов.Согласован);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеУтвержден",   Перечисления.СостоянияОбъектов.Утвержден);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеОтложен",     Перечисления.СостоянияОбъектов.Отложен);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеОтклонен",    Перечисления.СостоянияОбъектов.Отклонен);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеПодготовлен", Перечисления.СостоянияОбъектов.Подготовлен);
	
	ИзменитьКОплатеНаСегодня();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СтатусЗаявокБылИзменен" Тогда
		Элементы.Список.Обновить();
	КонецЕсли; 
	ИзменитьКОплатеНаСегодня();	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки.Вставить("ОтборСписка", Список.Отбор);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ВосстановитьНастройкиОтборов(Настройки.Получить("ОтборСписка"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

Процедура ИзменитьКОплатеНаСегодня()
	Если Не ЗначениеЗаполнено(Элементы.Список.Период.ДатаНачала) Тогда
		ДатаНач = НачалоДня(ТекущаяДата());
	Иначе
		ДатаНач = Элементы.Список.Период.ДатаНачала;	
	КонецЕсли; 			   
	Если Не ЗначениеЗаполнено(Элементы.Список.Период.ДатаОкончания) Тогда
		ДатаКон = КонецДня(ТекущаяДата());
	Иначе
		ДатаКон = Элементы.Список.Период.ДатаОкончания;	
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаНаРасходованиеСредств.Ссылка,
	               |	СостоянияСогласованияЗаявокСрезПоследних.Состояние,
	               |	СостоянияСогласованияЗаявокСрезПоследних.Пользователь,
	               |	ВЫБОР
	               |		КОГДА ЗаявкаНаРасходованиеСредств.Проведен = ИСТИНА
	               |			ТОГДА ВЫБОР
	               |					КОГДА СостоянияСогласованияЗаявокСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияОбъектов.Утвержден)
	               |						ТОГДА ""НЕОПЛАЧЕНО""
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ВложенныйЗапрос.СуммаОстаток ЕСТЬ NULL
	               |								ТОГДА ""ОПЛАЧЕНО""
	               |							КОГДА НЕ ВложенныйЗапрос.СуммаОстаток ЕСТЬ NULL
	               |									И ВложенныйЗапрос.СуммаОстаток <> ЗаявкаНаРасходованиеСредств.СуммаДокумента
	               |								ТОГДА ""ОПЛАЧЕНО ЧАСТИЧНО""
	               |							ИНАЧЕ ""НЕОПЛАЧЕНО""
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |	КОНЕЦ КАК ОПЛАТА,
	               |	ЗаявкаНаРасходованиеСредств.СуммаДокумента
	               |ПОМЕСТИТЬ ВсеЗаявки
	               |ИЗ
	               |	Документ.ЗаявкаНаРасходованиеСредств КАК ЗаявкаНаРасходованиеСредств
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСогласованияЗаявок.СрезПоследних КАК СостоянияСогласованияЗаявокСрезПоследних
	               |		ПО ЗаявкаНаРасходованиеСредств.Ссылка = СостоянияСогласованияЗаявокСрезПоследних.Заявка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование КАК ЗаявкаНаРасходование,
	               |			ЗаявкиНаРасходованиеСредствОстатки.СуммаОстаток КАК СуммаОстаток
	               |		ИЗ
	               |			РегистрНакопления.ЗаявкиНаРасходованиеСредств.Остатки(&ДатаКон, ) КАК ЗаявкиНаРасходованиеСредствОстатки) КАК ВложенныйЗапрос
	               |		ПО ЗаявкаНаРасходованиеСредств.Ссылка = ВложенныйЗапрос.ЗаявкаНаРасходование
	               |ГДЕ
	               |	ЗаявкаНаРасходованиеСредств.ДатаРасхода = &ДатаНач
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеЗаявки.ОПЛАТА,
	               |	СУММА(ВсеЗаявки.СуммаДокумента) КАК СуммаДокумента
	               |ИЗ
	               |	ВсеЗаявки КАК ВсеЗаявки
	               |ГДЕ
	               |	ВсеЗаявки.ОПЛАТА = ""НЕОПЛАЧЕНО""
	               |	И ВсеЗаявки.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОбъектов.Утвержден)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВсеЗаявки.ОПЛАТА";
 			   
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() <> 0 Тогда
		КОплатеНаСегодня = 	ТЗ.Итог("СуммаДокумента");
	Иначе
		КОплатеНаСегодня = 0;
	КонецЕсли; 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаявкаНаРасходованиеСредств.Ссылка,
		               |	СостоянияСогласованияЗаявокСрезПоследних.Состояние,
		               |	СостоянияСогласованияЗаявокСрезПоследних.Пользователь,
		               |	ВЫБОР
		               |		КОГДА ЗаявкаНаРасходованиеСредств.Проведен = ИСТИНА
		               |			ТОГДА ВЫБОР
		               |					КОГДА СостоянияСогласованияЗаявокСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияОбъектов.Утвержден)
		               |						ТОГДА ""НЕОПЛАЧЕНО""
		               |					ИНАЧЕ ВЫБОР
		               |							КОГДА ВложенныйЗапрос.СуммаОстаток ЕСТЬ NULL
		               |								ТОГДА ""ОПЛАЧЕНО""
		               |							КОГДА НЕ ВложенныйЗапрос.СуммаОстаток ЕСТЬ NULL
		               |									И ВложенныйЗапрос.СуммаОстаток <> ЗаявкаНаРасходованиеСредств.СуммаДокумента
		               |								ТОГДА ""ОПЛАЧЕНО ЧАСТИЧНО""
		               |							ИНАЧЕ ""НЕОПЛАЧЕНО""
		               |						КОНЕЦ
		               |				КОНЕЦ
		               |	КОНЕЦ КАК ОПЛАТА,
		               |	ЗаявкаНаРасходованиеСредств.СуммаДокумента
		               |ПОМЕСТИТЬ ВсеЗаявки
		               |ИЗ
		               |	Документ.ЗаявкаНаРасходованиеСредств КАК ЗаявкаНаРасходованиеСредств
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСогласованияЗаявок.СрезПоследних КАК СостоянияСогласованияЗаявокСрезПоследних
		               |		ПО ЗаявкаНаРасходованиеСредств.Ссылка = СостоянияСогласованияЗаявокСрезПоследних.Заявка
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование КАК ЗаявкаНаРасходование,
		               |			ЗаявкиНаРасходованиеСредствОстатки.СуммаОстаток КАК СуммаОстаток
		               |		ИЗ
		               |			РегистрНакопления.ЗаявкиНаРасходованиеСредств.Остатки(, ) КАК ЗаявкиНаРасходованиеСредствОстатки) КАК ВложенныйЗапрос
		               |		ПО ЗаявкаНаРасходованиеСредств.Ссылка = ВложенныйЗапрос.ЗаявкаНаРасходование
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВсеЗаявки.ОПЛАТА,
		               |	СУММА(ВсеЗаявки.СуммаДокумента) КАК СуммаДокумента
		               |ИЗ
		               |	ВсеЗаявки КАК ВсеЗаявки
		               |ГДЕ
		               |	ВсеЗаявки.ОПЛАТА = ""НЕОПЛАЧЕНО""
		               |	И ВсеЗаявки.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОбъектов.Утвержден)
		               |	И ВсеЗаявки.Ссылка.ДатаРасхода МЕЖДУ &ДатаНач И &ДатаКон
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВсеЗаявки.ОПЛАТА";
	ДатаНач = Дата('00010101');
	ДатаКон = ДатаКон - 3600*24;
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() <> 0 Тогда
		НеоплаченныеСуммыПрошлыхПериодов = 	ТЗ.Итог("СуммаДокумента");
	Иначе
		НеоплаченныеСуммыПрошлыхПериодов = 0;
	КонецЕсли;
КонецПроцедуры
